export default function Footer() {
    return (
        <footer className="h-[465px] relative  bottom-[60px]">
            <div className="bg-[#27241D] absolute h-[100%] w-[100%]  z-[-1]">
                <div className="flex flex-col w-[1504px] h-[100%] justify-center text-[#A3A3A3] px-14 font-bold text-[13px] gap-10 pt-27">
                     <p>¹Сотрудничество с организациями, оказывающими услуги по доставке заказов, оформленных с помощью сервиса Яндекс Еда, а также прямое сотрудничество с курьерами-прямыми партнерами сервиса Яндекс Еда в статусе самозанятых. Условия и результаты индивидуальны и могут отличаться от указанных. Указан средний показатель дохода по территории РФ на основании данных статистики сервиса Яндекс Еда. Чтобы узнать подробности, отправьте заявку.<br/><br/>²Для курьеров-прямых партнеров сервиса Яндекс Еда в статусе самозанятых. Выплаты за пятницу, субботу, воскресенье производятся в понедельник. По вопросам сроков выплат курьерам, сотрудничающим с партнерами сервиса Яндекс Еда, необходимо обращаться в соответствующую организацию-партнера сервиса Яндекс Еда.<br/><br/>³Страхование вне слотов доступно для прямых самозанятых курьеров, при условии выполнения количества заказов.<br/><br/>Данный сайт используется для привлечения кандидатов к партнерам сервиса Яндекс Еда. Этот сайт не принадлежит и не относится к компании ООО Яндекс. Материалы используемые на сайте, найдены в открытых источниках.</p>
                     <span className="text-white">© 2025 Партнер сервиса Яндекс Еда</span>
                </div>
            </div>
        </footer>
    )
}