export default function Footer() {
    return (
        <footer className="bg-[#27241D] text-[#A3A3A3] font-bold text-sm sm:text-[13px] px-6 sm:px-10 py-12 sm:py-16 mt-10 rounded-t-[24px]">
            <div className="max-w-7xl mx-auto flex flex-col gap-8 text-justify leading-relaxed">
                <p>
                    ¹ Сотрудничество с организациями, оказывающими услуги по доставке заказов, оформленных с помощью сервиса Яндекс Еда, а также прямое сотрудничество с курьерами-прямыми партнерами сервиса Яндекс Еда в статусе самозанятых. Условия и результаты индивидуальны и могут отличаться от указанных. Указан средний показатель дохода по территории РФ на основании данных статистики сервиса Яндекс Еда. Чтобы узнать подробности, отправьте заявку.

                    <br /><br />
                    ² Для курьеров-прямых партнеров сервиса Яндекс Еда в статусе самозанятых. Выплаты за пятницу, субботу, воскресенье производятся в понедельник. По вопросам сроков выплат курьерам, сотрудничающим с партнерами сервиса Яндекс Еда, необходимо обращаться в соответствующую организацию-партнера сервиса Яндекс Еда.

                    <br /><br />
                    ³ Страхование вне слотов доступно для прямых самозанятых курьеров, при условии выполнения количества заказов.

                    <br /><br />
                    Данный сайт используется для привлечения кандидатов к партнерам сервиса Яндекс Еда. Этот сайт не принадлежит и не относится к компании ООО Яндекс. Материалы, используемые на сайте, найдены в открытых источниках.
                </p>
                <span className="text-white text-center block">
                    © 2025 Партнер сервиса Яндекс Еда
                </span>
            </div>
        </footer>
    );
}
